{
    "version": "https://jsonfeed.org/version/1",
    "title": "Hello &lt;TechEd&gt; World!",
    "description": "",
    "home_page_url": "https://AneteZepa.github.io/blog",
    "feed_url": "https://AneteZepa.github.io/blog/feed.json",
    "user_comment": "",
    "author": {
        "name": "Anete Zepa"
    },
    "items": [
        {
            "id": "https://AneteZepa.github.io/blog/ten-ideas-later-we-have-stories/",
            "url": "https://AneteZepa.github.io/blog/ten-ideas-later-we-have-stories/",
            "title": "Ten ideas later, we have stories",
            "summary": "That is how many drafts of various topics I wrote and did not publish before this one. Many are half done. There are ideas, points, and paragraphs, but they lack flow or connection. They do not tell a story (yet) — a story you could&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">That is how many drafts of various topics I wrote and did not publish before this one.  </span><span style=\"font-weight: 400;\">Many are half done. There are ideas, points, and paragraphs, but they lack flow or connection. They do not tell a story (</span><i><span style=\"font-weight: 400;\">yet</span></i><span style=\"font-weight: 400;\">) — a story you could remember, relate to, and enjoy reading. <em>I hope you enjoy this :)</em></span></p>\n<p><span style=\"font-weight: 400;\">Why does it matter? We humans </span><i><span style=\"font-weight: 400;\">remember and internalize stories</span></i><span style=\"font-weight: 400;\">. </span></p>\n<p><span style=\"font-weight: 400;\">Research shows that story narratives are far easier to recall than raw facts, because they connect ideas to a broader context and create emotions. Compare these two graphs (illustrative purpose only with generated data):</span></p>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://AneteZepa.github.io/blog/media/posts/5/not_a_story.png\" alt=\"A gray histogram of exam scores from 0 to 100 with many thin bars. The chart has the vague title “Scores Distribution” and unlabeled axes marked “Value” and “Frequency.” There are no grade cutoffs, benchmarks, or explanations. The visual is cluttered and doesn’t highlight any key insight.\" width=\"1580\" height=\"981\" sizes=\"(min-width: 1500px) calc(7.87vw + 610px), (min-width: 900px) calc(44.48vw + 68px), (min-width: 780px) calc(8vw + 604px), calc(84.35vw + 23px)\" srcset=\"https://AneteZepa.github.io/blog/media/posts/5/responsive/not_a_story-xs.png 300w ,https://AneteZepa.github.io/blog/media/posts/5/responsive/not_a_story-sm.png 480w ,https://AneteZepa.github.io/blog/media/posts/5/responsive/not_a_story-md.png 768w\"></figure>\n<figure class=\"post__image post__image--center\"><img loading=\"lazy\"  src=\"https://AneteZepa.github.io/blog/media/posts/5/story_first.png\" alt=\"A smoothed distribution curve of exam scores, with the area above the 70-point benchmark shaded crimson to show the 72% of students who pass. Vertical lines mark grade cutoffs (F, D, C, B, A). A dashed crimson line at 70 is labeled “Benchmark = 70.” Two overlaid density traces show male and female distributions, with annotations calling out the pass rate and median scores by gender. The title states the takeaway: “72% Meet the 70-Point Benchmark; Small Gender Gap in Scores.”\" width=\"1877\" height=\"1178\" sizes=\"(min-width: 1500px) calc(7.87vw + 610px), (min-width: 900px) calc(44.48vw + 68px), (min-width: 780px) calc(8vw + 604px), calc(84.35vw + 23px)\" srcset=\"https://AneteZepa.github.io/blog/media/posts/5/responsive/story_first-xs.png 300w ,https://AneteZepa.github.io/blog/media/posts/5/responsive/story_first-sm.png 480w ,https://AneteZepa.github.io/blog/media/posts/5/responsive/story_first-md.png 768w\"></figure>\n<p><span style=\"font-weight: 400;\">They have the same data, but one’s story is much clearer, richer. </span></p>\n<p><span style=\"font-weight: 400;\">In technical communication (learning materials, documentation, books, YouTube videos, etc.), this means that (whenever possible) you should frame information in a story-like structure: </span><strong>problem, challenge, solution.</strong><span style=\"font-weight: 400;\"> </span></p>\n<p><span style=\"font-weight: 400;\">Doing so transforms the content from the dreaded <em>words-on-a-page</em> into something people can enjoy, remember, understand, and then utilize.</span></p>\n<h2>What's in it for me? (WIIFM)</h2>\n<p><span style=\"font-weight: 400;\">In learning materials, stories draw you in and can preemptively answer the most critical audience question, aka \"What's In It For Me\" (WIIFM): </span><span style=\"font-weight: 400;\"><em>Why</em> should I read/watch this? <em>What</em> is the point? And <em>how</em> do I use this?</span></p>\n<p><span style=\"font-weight: 400;\">How can we use stories in technical communication? </span></p>\n<p><span style=\"font-weight: 400;\">We already do, often without naming it. Case studies are stories. Examples are stories. Real-world problems are stories. Even simple “before and after” explanations are stories -- they set up a situation, introduce the challenge, and then show the path to solution.</span></p>\n<p><span style=\"font-weight: 400;\">The point isn’t to turn documentation into a novel or always include the history of the discovery in an explanation, but to recognize that people learn best when they can see themselves in the material.</span></p>\n<p><span style=\"font-weight: 400;\">Good stories provide context, flow, clarity, and meaning. They help the learner to understand and care about the topic (hopefully) enough to </span><span style=\"font-weight: 400;\">apply the new learning.</span></p>\n<p><i><span style=\"font-weight: 400;\">Next time, when you have something technical to communicate, think - would telling this as a story benefit your audience?</span></i></p>\n<p class=\"msg msg--highlight \">I'd love to hear your best stories - share the best piece of technical documentation or content you've seen that effectively uses a great story!</p>",
            "author": {
                "name": "Anete Zepa"
            },
            "tags": [
            ],
            "date_published": "2025-10-02T14:22:36+03:00",
            "date_modified": "2025-10-08T12:47:52+03:00"
        },
        {
            "id": "https://AneteZepa.github.io/blog/hello-lesstechedgreater-world-intro/",
            "url": "https://AneteZepa.github.io/blog/hello-lesstechedgreater-world-intro/",
            "title": "Hello &lt;TechEd&gt; World! - Intro",
            "summary": "This space is dedicated to practical ideas, tools, and methods that improve technical (topic) learning and education. Whether you’re a beginner, educator, team lead, or simply a tech enthusiast, I hope you’ll find posts here that help you teach, learn, or think more clearly. I’ve&hellip;",
            "content_html": "\n  <p>\n    This space is dedicated to practical ideas, tools, and methods that improve technical (topic) learning and education.\n  </p>\n\n  <p>\n    Whether you’re a <em>beginner, educator, team lead</em>, or simply a <em>tech enthusiast</em>, I hope you’ll find posts here that help you teach, learn, or think more clearly.\n  </p>\n\n    <h2 id=\"a-bit-about-me-waveandnbsp\">\n      A bit about me :wave:&nbsp;\n    </h2>\n\n  <p>\n    I’ve been working in tech education for over five years, starting while studying 'MComp AI and Computer Science' at the University of Sheffield.<br><br>Since then, I’ve worked across the tech education space as a learning experience designer, instructor, and content creator. Frequently, all at the same time.\n  </p>\n\n  <p>\n    I’ve built bite-sized lessons for mobile learning apps (<a href=\"https://www.sololearn.com/en/\" target=\"_blank\">Sololearn</a>), UK apprenticeship programs (<a href=\"https://www.multiverse.io/en-GB\" target=\"_blank\">Multiverse</a>, <a href=\"https://www.manchesterdigital.com/\" target=\"_blank\">Manchester Digital</a>, <a href=\"https://flipcomputing.com/\" target=\"_blank\">Flip Computing</a>), internal company training,&nbsp;MOOCs, and live classes (<a href=\"https://codefirstgirls.com/\" target=\"_blank\">Code First Girls</a>), and more.\n  </p>\n\n  <p>\n    I’ve worked with learners at many levels, from <strong>complete beginners to aspiring leaders,</strong> across topics like coding, AI, web development, leadership, and data.<br>\n  </p>\n\n    <h2 id=\"what-will-this-blog-have\">\n      What will this blog have?\n    </h2>\n\n  <p>\n    Good question! So far, I have come up with these guiding points:\n  </p>\n\n  <ul>\n    <li>Insights into tech learning design and course creation - to AI or not to AI</li><li>Tips and frameworks for content creators and educators</li><li>Big-picture thoughts on education, tech culture, and how we grow<br></li><li>Educational takes on new tools, languages, and ideas</li>\n  </ul>\n\n  <p>\n    Sometimes it’ll be a short post about a tool I loved this week. Other times, it might be advice for teaching difficult topics or how we can build better developer education programs. Either way, it’ll be useful, honest, and aimed at making tech learning a little better for everyone.\n  </p>\n\n    <h2 id=\"phylosophy\">\n      Phylosophy\n    </h2>\n\n  <p>\n    I care most about the learner — because in a world of lifelong learning, we’re all learners. What if learning felt natural, personal, and just right? That’s the kind of future I want to help build.\n  </p>\n\n  <ul>\n    <li>Education is for everyone, and it should be built like that</li><li>AI will make education better</li><li>You cannot learn how to code without coding</li><li>Sometimes it was your teacher’s fault</li>\n  </ul>\n\n  <p>\n    Thanks for stopping by.<br>— Anete\n  </p>\n\n  <p>\n    TLDR: Welcome to \"Hello &lt;TechEd&gt; World!\"—a blog focused on effective tech education. The author, with over five years of experience in tech education, will share insights on tools, learning design, and content creation.\n  </p>\n\n  <p>\n    \n  </p>",
            "image": "https://AneteZepa.github.io/blog/media/posts/1/IMG_1951.JPG",
            "author": {
                "name": "Anete Zepa"
            },
            "tags": [
            ],
            "date_published": "2025-09-16T16:31:30+03:00",
            "date_modified": "2025-09-16T16:39:53+03:00"
        }
    ]
}
